// Функція checkStorage(storage, item) приймає два параметри:
// storage - масив рядків, що описує доступні товари на складі
// item - рядок з назвою товара, наявність якого потрібно перевірити
// Доповни код функції таким чином, щоб вона перевіряла,
// чи присутній такий товар в масиві storage і повертала:

// рядок "<item> is available to order!", де item - це назва товара,
// якщо товар було знайдено
// рядок "Sorry! We are out of stock!", якщо такого товара немає в масиві
// Зроби так, щоб пошук за ім'ям товару був незалежний від регістру,
// тобто наприклад "plum" і "pLuM"
// мають бути знайдені у масиві["apple", "plum", "pear"].

// function checkStorage(storage, item) {
//   if (storage.includes(item.toLowerCase())) {
//     return `${item.toLowerCase()} is available to order!`;
//   } else {
//     return `Sorry! We are out of stock!`;
//   }
// }

// console.log(checkStorage(['apple', 'plum', 'pear'], 'pLuM')); // plum is available to order!
// ===============================================================================
// ===============================================================================
// Функція getCommonElements(array1, array2), приймає два масиви
// (array1 та array2) довільної довжини в якості параметрів.

// Доповни код функції:

// Створи порожній масив для зберігання нового масиву.
// Використай цикл for для ітерації кожного елемента у array1.
// У тілі циклу перевір, чи поточний елемент існує у array2 за
// допомогою методу includes.
// Якщо він існує, то додай елемент до нового масиву.
// Поверни наповнений масив спільних елементів як результат роботи функції.
// function getCommonElements(array1, array2) {
//   const res = [];
//   for (i = 0; i < array1.length; i++) {
//     if (array2.includes(array1[i])) {
//       res.push(array1[i]);
//     }
//   }
//   return res;
// }
// console.log(getCommonElements([1, 2, 3], [2, 4])); // [2]
// console.log(getCommonElements([24, 12, 27, 3], [12, 8, 3, 36, 27])); // [12, 27, 3]
// ==========================================================
// ============================================================
// Доповни код функції calculateTotalPrice(order) так,
// щоб вона повертала загальну суму чисел в масиві order.
// Використай цикл for...of для перебору масиву.

// function calculateTotalPrice(order) {
//   let sum = 0;
//   for (const elem of order) {
//     sum += elem;
//   }
//   return sum;
// }

// console.log(calculateTotalPrice([12, 85, 37, 4])); // 138
// console.log(calculateTotalPrice([164, 48, 291])); // 503

// ===================================================================================
// ========================================================================================
// Функція createReversedArray() може приймати довільну кількість аргументів.
//  Доповни код функції так, щоб вона повертала масив усіх аргументів,
// але в масиві вони повинні йти у зворотному порядку.Тобто,
// при виклику createReversedArray(1, 2, 3), функція має повернути масив[3, 2, 1].
// Використовуй цикл або метод масиву toReversed(), який застосовується до масиву
//  і результатом роботи повертає новий масив з елементами у зворотньому порядку.

// function createReversedArray() {
//   const args = Array.from(arguments);
//   return args.toReversed();
// }

// console.log(createReversedArray(12, 85, 37, 4)); // [4, 37, 85, 12]

// ====================================================================
// ======================================================================
// 1. Створіть масив `genres` з елементами "Jazz" та "Blues".
// 2. Додайте «Рок-н-рол» до кінця.
// 3. Виведіть у консоль перший елемент масиву.
// 4. Виведіть останній елемент масиву в консоль. Код повинен працювати для масиву
//    довільної довжини.
// 5. Видаліть перший елемент та виведіть його в консоль.
// 6. Вставте «Country» та «Reggae» на початок масиву.

// const genres = ['Jazz', 'Blues'];
// genres.push('Rock-n-roll');
// console.log(genres);
// console.log(genres[1]);
// console.log(genres[genres.length - 1]);
// genres.shift();
// genres.unshift('Country', 'Reggae');
// console.log(genres);
// =============================================================================
// =================================================================================
// Напиши скрипт для обчислення площі прямокутника зі сторонами, значення яких
// зберігаються у змінній `values` у вигляді рядка. Значення гарантовано розділені
// пробілом.

// const values = '8 11';
// const numbers = values.split(' ');
// const width = +numbers[0];
// const height = +numbers[1];
// const result = width * height;
// console.log(result);
// ===================================================================
// ======================================================================
// Напиши скрипт для перебору масиву `fruits` циклом `for`. Для кожного елемента
// масиву виведи в консоль рядок у форматі `номер_елемента: значення_елемента`.
// Нумерація елементів має починатися з `1`.

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];
// for (let i = 0; i < fruits.length; i++) {
//   const result = `${i + 1}: ${fruits[i]}`;
//   console.log(result);
// }

// =============================================================
// ================================================================
// Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача. У
// змінних `names` та `phones` зберігаються рядки імен та телефонних номерів,
// розділені комами. Порядковий номер імен та телефонів у рядках вказують на
// відповідність. Кількість імен та телефонів гарантовано однакова.

// const names = 'Jacob, William, Solomon, Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';
// const namesArray = names.split(',');
// const phonesArray = phones.split(',');
// console.log(namesArray);
// console.log(phonesArray);

// for (let i = 0; i < namesArray.length; i++) {
//   const list = `${namesArray[i]} - ${phonesArray[i]}`;
//   console.log(list);
// }

// ================================================================
// ===================================================================
// Напиши скрипт який виводить у консоль усі слова рядка окрім першого та
// останнього. Результуючий рядок не повинен починатися або закінчуватися символ
// пробілу. Скрипт повинен працювати для будь-якого рядка.

// const string = 'Welcome to the future';
// const stirngArr = string.split(' ').slice(1, -1).join(' ').trim();
// console.log(stirngArr);

// =======================================================================
// ==========================================================================
// Напиши скрипт, який «розгортає» рядок (зворотний порядок літер) і виводить її в
// консоль.

// const string = 'Welcome to the future';
// const stringArr = string.split(' ').toReversed().join(' ');
// console.log(stringArr);

// ===========================================================================
// ==============================================================================
// Напиши скрипт сортування масиву рядків в алфавітному порядку за першою літерою
// елемент.

// const langs = ['python', 'javascript', 'c++', 'haskel', 'php', 'ruby'];
// function sortByFirstLetter(a, b) {
//   const firstA = a[0].toLowerCase();
//   const firstB = b[0].toLowerCase();

//   if (firstA < firstB) {
//     return -1;
//   } else if (firstA > firstB) {
//     return 1;
//   } else {
//     return 0;
//   }
// }

// // Сортування масиву за першою літерою
// langs.sort(sortByFirstLetter);

// console.log(langs);

// // Сортування масиву за першою літерою
// langs.sort((a, b) => a[0].toLowerCase().localeCompare(b[0].toLowerCase()));

// console.log(langs);

// =================================================
// ====================================================
// Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати для
// будь-якого масиву чисел. Використовуй цикл для розв'язання задачі.

// const numbers = [2, 17, 94, 1, 23, 37];
// let min = numbers[0];
// for (const number of numbers) {
//   if (number < min) {
//     min = number;
//   }
// }
// console.log(min); // 1

// ======================================================================
// ============================================================================
